[
  {
    "ideal": "- Broad scope: Covers all information of a confidential nature, whether owned, used by, or relating to the Discloser.\n- Form agnostic: Applies regardless of format – oral, written, electronic, visual, etc.\n- Designation not required: Includes information whether or not marked or labeled as “confidential” or “proprietary”.\n- Circumstantial protection: Captures information that reasonably should be understood as confidential based on its nature or the context of disclosure.\n- Temporal coverage: Includes information disclosed before, during, or after the agreement is signed.\n- Ownership clarity: Emphasizes that confidentiality applies regardless of whether the information is created by or merely relates to the Discloser.\n- Catch-all safeguard: Ensures protection even for inadvertently disclosed or unmarked confidential material.",
    "clause": "Confidential Information",
    "red_flag": "- Requires all confidential information to be in writing and labeled – Ignores oral disclosures and unmarked sensitive information.\n- Excludes information not expressly designated as “confidential” – Allows the recipient to deny obligations for obviously sensitive but unmarked data.\n- Applies only to a narrow category of information (e.g. “technical” or “financial”) – Fails to cover commercial, operational, legal, or strategic info.\n- Excludes disclosures prior to the agreement date – Leaves earlier discussions or due diligence unprotected.\n- Overbroad exclusions – e.g., allows recipient to rely on any third-party source, or to claim independent development without requiring proof.\n- Vague or circular definitions – Definitions like “Confidential Information means confidential information” lack clarity and enforceability.\n- Unreasonably short confidentiality period – E.g., less than 1 year, which is often too short to protect long-term interests.\n- Allows recipient to self-determine what is or isn’t confidential – Undermines the Discloser’s intent and opens the door to dispute.\n- No protection for derivative information – Allows use of summaries, analyses, or learnings derived from the confidential information.\n- Ambiguous applicability – Definition fails to make clear whether the obligations apply to affiliates, subcontractors, or employees.",
    "acceptable": "- Form limited to written/electronic: Limits the definition to tangible formats (e.g. excludes oral disclosures unless confirmed in writing).\n- Requires designation: Only covers information marked as confidential or identified in writing as confidential within a certain time period (e.g. within 30 days of disclosure).\n- Excludes pre-agreement disclosures: Covers only information disclosed on or after the effective date.\n- Narrower scope: Applies only to information relating directly to the discloser’s business, technology, or operations.\n- Standard exclusions included: Explicit carve-outs for information that is:\n- Publicly available (other than through breach),\n- Already known to the recipient,\n- Independently developed without reference to the confidential info,\n- Rightfully obtained from a third party without duty of confidentiality.\n- Time-limited confidentiality: Sets a defined confidentiality period (e.g. 2–5 years from disclosure).\n- No implied obligation: Recipient is only bound to treat information as confidential if it’s explicitly designated as such.",
    "is_required": true,
    "clause_definition": "This clause defines the term 'confidential information' for the purpose of the agreement. It is generally found in the definitions section or as a standalone clause",
    "review_instruction": "Ensure the clause captures the full scope of what qualifies as \"Confidential Information\" and protects the discloser’s interests across all formats and disclosure contexts.\nChecklist of what to Look For\n1. Broad Definition of Information\n2. Must cover all types of information, including:\n3. Oral, written, electronic, visual, or other formats\n4. Business plans, technical data, financials, customer info, etc.\n5. Should not be limited to written or marked documents only.\n6. Ownership / Usage\n7. Should apply to information owned, used by, or relating to the Discloser.\n8. Not just information that is proprietary or created by the Discloser.\n9. Form of Disclosure\n10. Check that the clause explicitly includes oral and electronic disclosures.\n11. Should cover disclosures made before, on, or after the NDA's effective date.\n12. Marked and Unmarked Information\n13. Look for coverage of information whether marked as confidential or not.\n14. Clause should include “whether or not identified as confidential or proprietary.”\n15. Reasonable Understanding - There should be a “reasonableness test”: i.e., information that a reasonable person would understand to be confidential under the circumstances.\n16. This protects unmarked but sensitive disclosures.\n17. Catch-All Protection - A solid clause usually ends with a catch-all, such as:\n“Whether disclosed before, on or after the date of this Agreement.”\nThis ensures retroactive protection for prior disclosures.",
    "example_ideal_clause": "\"Confidential Information\" means all information of a confidential nature owned or used by, or relating to Discloser regardless of form (oral, written or electronic), whether identified or designated as confidential or proprietary, or not, or that, due to the nature of such information or under the circumstances surrounding its disclosure reasonably should be understood to be treated as confidential by Recipient, whether disclosed before, on or after the date of signature;",
    "provision_definition": "This clause defines the term 'confidential information' for the purpose of the agreement. It is generally found in the definitions section or as a standalone clause",
    "example_fallback_clause": "“Confidential Information” means all information of a confidential nature owned or used by, or relating to Discloser regardless of form (oral, written or electronic), whether marked or otherwise identified as confidential or proprietary identified or designated as confidential or proprietary, or not, or that, due to the nature of such information or under the circumstances surrounding its disclosure, reasonably should be understood to be treated as confidential by Recipient, provided that such information is disclosed in connection with this Agreement and not otherwise publicly available, whether disclosed before, on or after the date of signature"
  },
  {
    "ideal": "- Clear commencement trigger: Agreement starts on the date the last party signs (i.e., mutual execution).\n- Fixed initial term: Specifies a definite duration of three (3) yeats\n- Survival of obligations (optional but preferred): Confidentiality and other relevant obligations should survive expiration or termination.\n- No ambiguity: Avoids vague terms like “from the date hereof” or “upon execution” without clarity on when execution occurs.",
    "clause": "Confidentiality period",
    "red_flag": "- Unclear or undefined start date – e.g., “upon execution” without specifying whose execution or what defines “execution”.\n- Commencement from first signature – creates risk of binding one party before mutual agreement.\n- Indefinite term – No end date or mechanism to exit the agreement.\n- Overly short term with no renewal – e.g., “1 month” or “until terminated” with no guarantee of stability.\n- Automatic termination on minimal notice – e.g., “either party may terminate at any time for any reason with 24 hours’ notice”.\n- Survival not addressed – Confidentiality or IP obligations may lapse if not explicitly stated to survive expiry.",
    "acceptable": "- Effective date tied to another event (e.g., “from the Effective Date” defined elsewhere).\n- Shorter initial term (e.g., 1–2 years) with auto-renewal unless terminated with notice.\n- Effective date based on delivery or signature by a single party, if that party is the discloser or controls risk.\n- Termination rights included for either party with prior written notice (e.g., 30 days).\n- Unilateral renewals allowed if Discloser has sole discretion.",
    "is_required": true,
    "clause_definition": "This clause defines the confidentiality period of the NDA. This is the defined period in which the confidentiality obligations are binding on the parties. This is typically a standalone clause or defined in the cover page.",
    "review_instruction": "Goal: Determine whether the duration of confidentiality obligations is clear, reasonable, and enforceable.\nWhat to Look For:\n1. Specified Duration\n2. Standard range: 2–5 years\n3. Longer only if justified (e.g. trade secrets = indefinite)\n4. Red flag if no duration is stated\n5. When the Period Starts: From disclosure date or termination of agreement\n6. Ensure clarity on the timelineSurvival After Termination\n7. Confirm the obligation continues after the NDA ends\n8. Trade Secret Carve-Out (if applicable) - should state: “Protected indefinitely while still qualifying as a trade secret”\n9. Watch out for overly long or indefinite periods not tied to trade secrets\n10. Ensure obligations are limited to when information is confidential\n",
    "example_ideal_clause": "This agreement is effective from date of signature by the party signing last in time and will continue for a period of three (3) years.",
    "provision_definition": "This clause defines the confidentiality period of the NDA. This is the defined period in which the confidentiality obligations are binding on the parties. This is typically a standalone clause or defined in the cover page.",
    "example_fallback_clause": "This agreement is effective from date of signature by the party signing last in time and will continue for a period of two (2) years."
  },
  {
    "ideal": "- Specificity of purpose: Clearly states the limited purposes for which confidential information is disclosed.\n- Multiple permissible use cases: Includes all relevant commercial scenarios, such as:\n- Exploring or formalising a commercial relationship\n- Marketing or evaluating Discloser’s offerings\n- Assessing supplier or vendor fit\n- Any other customised or defined purpose (e.g. ${purpose_of_disclosure} placeholder)\n- Purpose-limiting language: Implies that use of Confidential Information outside these purposes is restricted.\n- Reciprocity or neutrality: Fairly worded if both parties will disclose information (e.g. both can investigate, market, evaluate).\n- Drafting flexibility: Leaves room for expansion if required via agreement in writing.",
    "clause": "Purpose of NDA",
    "red_flag": "- No stated purpose at all – Leaves open-ended use of the confidential information.\n- Overbroad or vague purpose – e.g., “for any business purpose” or “for general commercial benefit”.\n- One-sided usage rights – e.g., recipient may use Confidential Information “for its own internal business use”.\n- No restriction on marketing use – Recipient could use Discloser’s confidential material in their own marketing.\n- Implied right to share with third parties – e.g., “to explore opportunities with partners or customers” without restriction.\n- Purpose misaligned with actual intention – e.g., clause says “to evaluate vendor relationship” but the actual deal is about investment.",
    "acceptable": "- Single-purpose clauses – e.g., “to evaluate a potential commercial relationship” (less flexible but workable).\n- High-level business context – e.g., “for use in business discussions between the parties”.\n- Non-exclusive use cases – Does not list all purposes but leaves scope open (“including but not limited to…”).\n- Party-specific language – e.g., Confidential Information is only to evaluate the discloser’s offerings (acceptable if only one party discloses).\n- Reference to project or transaction – e.g., “in connection with Project Falcon” (as long as that’s defined).",
    "is_required": true,
    "clause_definition": "This clause defines the purpose of the NDA. This can either be defined in the 'Definitions' section or as a standalone clause",
    "review_instruction": "Goal: Ensure the clause clearly and narrowly defines why confidential information is being shared. This protects the discloser by limiting use of the information to an agreed context.\nWhat to Look For:\n1. Defined, Narrow Purpose\n2. The clause should specifically state the purpose(s) of disclosure.\n3. The narrower and more accurate, the better.\n4. Check if the ${purpose_of_disclosure} field is completed. If left blank, that’s a gap — it must be filled before execution.\n5. The purpose should reflect real commercial intent (e.g. “integration of Discloser’s AI tooling into Recipient’s procurement workflow”).\n6. The clause should prevent information from being used for any purpose outside the stated reason.\n7. Watch for phrases that overly broaden usage (e.g. “any business purpose”).\nCheck Business Context & Request Origin:\n1. What type of legal request is this? (e.g. early-stage partnership, vendor onboarding, investment)\n2. Who is the counterparty? (e.g. startup, investor, enterprise buyer)\n3. Is the use case obvious from available context?\n4. If unclear, ask follow-up questions:\n“Can you confirm the intended purpose for which the information will be shared?”\n“Please clarify what relationship is being explored and what info will be disclosed.”\n“Could you complete the purpose field based on the business rationale?”\n",
    "example_ideal_clause": "Purpose. Confidential information is being disclosed in order to:\ninvestigate or formalise a possible commercial relationship between the parties;\nmarket the offerings of discloser;\ninvestigate the possibility of either party becoming a supplier to the other or its customers; and\n${purpose_of_disclosure}\n",
    "provision_definition": "This clause defines the purpose of the NDA. This can either be defined in the 'Definitions' section or as a standalone clause",
    "example_fallback_clause": "Confidential Information is being disclosed for the purpose of evaluating, negotiating, or executing a potential commercial relationship between the parties, and for related internal decision-making purposes."
  },
  {
    "ideal": "1. Core confidentiality obligation\nRequires Recipient to keep all Confidential Information confidential.\nObligation includes reasonable and appropriate security precautions.\nStandard of care is tied to Recipient’s own practices (same or better).\n2. Use restrictions\nRecipient may only use Confidential Information for the specified purpose under the agreement.\nMust not use for any other purpose without prior written consent.\n3. Internal access control\nDisclosure limited to personnel on a need-to-know basis.\nPersonnel must commit to confidentiality (ideally in writing).\nSecurity procedures required to ensure ongoing compliance.\n4. Prohibition on misuse\nExpress prohibitions on:\nReverse engineering\nDecompilation/disassembly of software or tools\nUse that causes harm to the Discloser\n5. Personal information clause\nPersonal data sharing must be explicitly requested by the Recipient.\nDiscloser must comply with data protection laws before disclosing personal information.\n6. Breach notification duty\nRecipient must promptly notify Discloser of:\nLoss\nDisclosure\nBreach\nMisuse of Confidential Information\n7. Standard exclusions\nResponsibilities do not apply to information that is:\nAlready known without obligation of confidence\nPublicly available (not through breach)\nBecomes public lawfully\nIndependently developed\nApproved for disclosure in writing",
    "clause": "Recipient's Obligations",
    "red_flag": "1. No explicit use restriction tied to purpose\n2. No mention of confidentiality agreements for internal staff\n3. No duty to notify of breaches or misappropriation\n4. No restriction on reverse engineering\n5. Exceptions are too vague or overly broad",
    "acceptable": "- May be tolerable depending on context and risk profile:\n- Oral confidentiality undertakings from personnel (vs written).\n- Standard of care based on “reasonable efforts” instead of “same degree of care”.\n- Exclusion of reverse engineering clause if no software or technical assets are involved.\n- No explicit notification timeline as long as breach notification still required.\n- General data protection reference without reference to specific laws (e.g., GDPR).",
    "is_required": true,
    "clause_definition": "This clause sets out the recipient’s responsibilities for protecting confidential information. It includes duties to maintain confidentiality, restrict use, limit internal access, prevent misuse (e.g., reverse engineering), notify the discloser of breaches, and outlines standard exceptions.\nUsually located in the middle or later sections of the NDA, often titled “Confidentiality Obligations,” “Recipient’s Obligations,” or “Use and Protection of Confidential Information.”",
    "review_instruction": "Goal: Ensure the recipient is bound to properly protect, limit, and responsibly handle confidential information, with clear restrictions and exceptions.\nWhat to Look For\n1. Obligation to Keep Information Confidential\n- Clause requires the recipient to keep the information confidential and apply reasonable and appropriate security precautions.\n- Standard of care should at minimum match the care taken with the recipient’s own confidential info.\n2. A clear and active duty (not just passive)\n3. Inclusion of physical, technical, and organizational safeguards\n4. Use Restrictions: Confidential information must be used only for the purpose stated in the agreement, and no other use is allowed unless physically written consent is given; Access must be limited to personnel who “need to know”.\nWatch for clarity around:\nNo reuse or commercial exploitation of confidential info\nNo internal broad sharing without confidentiality safeguards\n3. Confidentiality Obligations for Personnel. This is critical for enforceability and limiting risk of indirect leaks. Recipient must:\n- Get written confidentiality undertakings from personnel\n- Ensure staff apply reasonable security measures\n- Only share what’s necessary\n4. Reverse Engineering and Harmful Use Prohibition. Recipient is prohibited from:\n- Reverse engineering, decompiling, or disassembling any software\n- Using confidential info in a way that causes harm or loss\n- This protects trade secrets and code-based disclosures — flag if absent when disclosing technical IP.\n5. Personal Information Clause\n- Clause states discloser won’t provide personal data unless specifically requested.\n- Discloser remains responsible for compliance with applicable data privacy laws.\n- This protects you if no data processing agreement (DPA) is in place. Ask whether personal data will be shared — and if so, escalate for DPA review.\n6. Duty to Notify - Recipient must promptly notify Discloser of any: Unauthorized loss, disclosure, breach, or use/misappropriation\n- Even better if it includes a timeframe (e.g., “within 72 hours”) or refers to applicable data breach laws.\n7. Standard Exceptions - Clause excludes info that is:\n- Already known without obligation of confidence\n- Publicly available (without breach)\n- Independently developed\n- Disclosed with Discloser’s consent\n- Check for proof condition: Prefer wording like “can be demonstrated by written records” to prevent abuse of the “independently developed” exception.\nContext Check & Follow-Up\n1. Before approving or redlining, assess the context:\n2. Understand the business context:\n- What is the nature of the proposed relationship (supplier, vendor, M&A, investor)?\n- Will confidential information include source code, strategy, financials, or personal data?\n3. Research the counterparty:\n- Who are they? (e.g., early-stage startup vs. enterprise)\n- Do they have policies around confidentiality or standard forms?\n4. If unclear or incomplete:\nFollow up with the requester:\n- “Will any personal data or proprietary code be shared?”\n- “Do you expect their employees or third parties to access the info?”\n- “Can we confirm what types of information will be shared so we can scope the obligations appropriately?”",
    "example_ideal_clause": "1. Keep confidential. Recipient will keep the Confidential Information confidential and will take all reasonable and appropriate security precautions to maintain the confidentiality of the confidential information (which will include applying the same degree of care and security precautions as it takes to protect Recipient’s own confidential information).\n2. Personal information disclosed. Notwithstanding anything else in this agreement, Discloser will not provide any personal information to Recipient unless specifically requested to do so by Recipient. Discloser will comply with all applicable laws regarding any personal information which Discloser provides to Recipient pursuant to this agreement.\nRecipient’s responsibilities. Recipient will:\n2.1 only use confidential information to comply with Recipient’s responsibilities under this agreement;\n2.2 only give confidential information to any of Recipient’s personnel that need it, and only give as much of it as they need;\n2.3 use reasonable security procedures to make sure personnel keep the confidential information confidential;\n2.4 get written promises of confidentiality from those personnel who need access to the confidential information;\n2.5 not reveal the confidential information to anyone else; and\n2.6 only use the confidential information for the purpose and for no other purpose unless with the prior physical written consent from Discloser.\n3. Restrictions of use. Recipient will not:\n3.1 reverse engineer, decompile or disassemble any software or programs forming part of the confidential information; and\n3.2 use the confidential information in any manner that will cause loss or damage to Discloser.\n4. Duty to notify. As required by applicable law, Recipient will promptly notify Discloser upon becoming aware of any authorised:\nLoss;\n4.1 Disclosure;\n4.2 breach of confidentiality; or\n4.3 use or misappropriation;\n4.4 of confidential information.\n5. Exceptions. These responsibilities will not apply to any information that:\n5.1 Recipient already had knowledge of the confidential information prior to disclosure by Discloser and was not received by Recipient from Discloser under an obligation of confidence;\n5.2 is lawfully in the public domain (available to the general public) when Recipient received it;\n5.3 lawfully becomes part of the public domain afterwards;\n5.4 is independently developed by Recipient (or those related to Recipient) or for Recipient by third parties independently of the information disclosed by Discloser; or\n5.5 is disclosed by Recipient with the prior written approval of Disclosure's authorised representative.\n",
    "provision_definition": "This clause sets out the recipient’s responsibilities for protecting confidential information. It includes duties to maintain confidentiality, restrict use, limit internal access, prevent misuse (e.g., reverse engineering), notify the discloser of breaches, and outlines standard exceptions.\nUsually located in the middle or later sections of the NDA, often titled “Confidentiality Obligations,” “Recipient’s Obligations,” or “Use and Protection of Confidential Information.”",
    "example_fallback_clause": "Confidentiality Obligations\nRecipient agrees to maintain the confidentiality of the Confidential Information using at least a reasonable degree of care, and in any event no less than the standard it applies to its own confidential information. Recipient will only use the Confidential Information for the purpose described in this Agreement and will not disclose it to any third party except to its personnel, contractors, or advisors who have a legitimate need to know the information for that purpose, and who are bound by confidentiality obligations no less protective than those set out in this Agreement.\nRecipient shall not reverse engineer, decompile, or disassemble any software or materials received as Confidential Information and will not use the Confidential Information in a way that causes harm or loss to Discloser.\nRecipient will notify Discloser promptly upon becoming aware of any unauthorized disclosure or use of the Confidential Information.\nThese obligations shall not apply to information that: (a) was already known by Recipient without a duty of confidentiality; (b) is or becomes publicly available through no fault of Recipient; (c) is independently developed by Recipient without reference to the Confidential Information; or (d) is disclosed with the Discloser’s prior written consent."
  },
  {
    "ideal": "- Mandatory legal disclosure exception: Allows Recipient to disclose Confidential Information only when required by law, court order, or government authority.\n- Advance notice: Recipient must give reasonable written notice to Discloser before disclosure, where legally permitted.\n- Carve-out for routine audits: Routine regulatory reviews or blanket requests that don’t identify Discloser are excluded from the notice requirement (practical and standard).\n- Cooperation requirement: Recipient must consult with Discloser on steps to avoid or limit the disclosure.\n- Mitigation efforts: Recipient must take agreed steps with Discloser to protect the information.\n- Confidentiality assurance: Requires reasonable endeavours to obtain assurance from the authority that disclosed information will remain confidential.\n- Balance of compliance and protection: Strikes a fair balance between complying with the law and safeguarding Discloser’s interests.",
    "clause": "Disclosure required by Law",
    "red_flag": "1. No requirement to notify discloser\n2. No duty to consult or cooperate before disclosure\n3.  No effort required to preserve confidentiality after disclosure\n4. Broad allowances for disclosure that go beyond legal necessity\n5.  Disclosure permitted for routine audits without clear carve-outs",
    "acceptable": "- Notice only “where feasible” rather than “to the extent permitted by law”.\n- Shortened or unspecified consultation obligation – e.g., “may consult” instead of “must consult”.\n- No explicit routine audit carve-out – may still work if audits don’t typically involve confidential data.\n- No assurance effort clause, but includes “will take reasonable steps to preserve confidentiality” as a general fallback.\n- Generic legal compliance clause placed in another section of the agreement (e.g. under \"Compliance with Laws\").- ",
    "is_required": true,
    "clause_definition": "This clause provides an exception to confidentiality obligations where the recipient is legally compelled to disclose confidential information (e.g. by court order, subpoena, regulatory requirement). It also protects the discloser by requiring procedural safeguards before any such disclosure occurs.",
    "review_instruction": "What to Look For\n1. Legal Compulsion is Clearly Defined. Disclosure is only permitted if:\n- Required by law\n- Or by judicial, administrative, or governmental order\nThe clause should not allow discretionary or voluntary disclosures — it must be tied to a legal or regulatory obligation.\n2. Advance Notice to Discloser\n- Recipient must give reasonable prior written notice to the discloser before disclosing (unless prohibited by law).\n- Routine audits or blanket government requests not specifically targeting the discloser are typically excluded from this requirement.\n- If there's no obligation to notify the discloser, they lose the chance to intervene or protect their interests.\n3. Consultation and Cooperation\n-  Recipient must consult with the discloser on possible ways to prevent or limit disclosure.\n- They must take any agreed steps (e.g., filing a protective motion or narrowing the scope of the request).\n4. Efforts to Preserve Confidentiality\n- Recipient must use reasonable endeavours to ensure the compelled party (e.g., court or authority) treats the information as confidential.\n- Check: Look for language like: “...obtain assurances or orders that the information will be treated confidentially.”",
    "example_ideal_clause": "Recipient can disclose confidential information if required by law or in accordance with a judicial, administrative or governmental order, provided Recipient:\n- gives Discloser reasonable physical written notice prior to disclosure, to the extent such notice is permitted by law, and other than in connection with a routine audit or examination by, or a blanket document - request from, a regulatory or governmental entity that does not reference Discloser or the agreement;\n- consults with Discloser on possible steps to be taken to avoid or limit disclosure and takes steps agreed with Discloser; and\n- uses Recipient’s reasonable endeavours to obtain any assurance or order that disclosed confidential information will be treated confidentially by the authority or person to which it is disclosed.\n",
    "provision_definition": "This clause provides an exception to confidentiality obligations where the recipient is legally compelled to disclose confidential information (e.g. by court order, subpoena, regulatory requirement). It also protects the discloser by requiring procedural safeguards before any such disclosure occurs.",
    "example_fallback_clause": "Recipient may disclose Confidential Information if required to do so by applicable law, regulation, or a valid order of a court or governmental authority. Where legally permitted, Recipient will provide Discloser with prompt written notice prior to such disclosure to allow Discloser an opportunity to seek a protective order or other appropriate remedy. Recipient will cooperate with Discloser in good faith (at Discloser’s expense) in any such effort, and will only disclose that portion of the Confidential Information that is legally required."
  },
  {
    "ideal": "- Discloser-initiated: Obligations are triggered by written request from the Discloser.\n - Clear options: Recipient must either:\nReturn all confidential information (including originals, copies, summaries); or\nDestroy them at the Discloser’s option.\n- Comprehensive scope: Applies to all formats – physical, digital, and derivatives (e.g. notes, summaries, reproductions).\n- Certification of destruction: Recipient must provide written certification confirming destruction.\n- Prompt action: Requires action as soon as possible after request or destruction.\n- No retention rights: No right for Recipient to retain information unless legally required.\n- Covers back-ups if possible: (Not explicitly in the clause above, but best practice to include).\n- Physical writing: Certification must be non-electronic unless otherwise agreed, adding formality.",
    "clause": "Return of confidential information",
    "red_flag": "• Recipient may “elect” whether to return or destroy (instead of Discloser deciding).\n• No obligation to certify, or certification only “if requested”.\n• Open-ended retention (“retain as needed”, “within a reasonable time”).\n• Broad exceptions for “internal records”, “work-product”, or “system back-ups” without strict safeguards.\n• Silent on electronic data or metadata.\n• Costs of return/destruction shifted to Discloser.",
    "acceptable": "- “Reasonable timeframe” instead of “as soon as possible”.\n- “Commercially reasonable efforts” to return or destroy all materials.\n- Electronic certification instead of physical writing (if enforceable under local law).\n- Retention of archival copy for compliance (e.g., to satisfy legal or regulatory obligations), but only if: It’s securely stored, and Remains subject to confidentiality obligations.",
    "is_required": true,
    "clause_definition": "This clause requires the Recipient to either return or destroy all Confidential Information received from the Discloser upon request or at the end of the agreement. It ensures that no copies—whether physical, digital, or derivative—are retained beyond the permitted timeframe and that any such return or destruction is certified in writing (or as otherwise agreed).\nIt typically covers:\nOriginal documents\nCopies, summaries, notes, or extracts\nElectronically stored information\nMetadata and derived data\nIt may also include exceptions for:\nArchival copies retained for legal or compliance reasons\nRoutine IT back-ups (if not readily accessible and still subject to confidentiality)\nTypically found near the end of the NDA under sections titled “Return of Materials,” “Destruction of Information,” “Obligations on Termination,” or “Confidentiality – Continuing Obligations.”",
    "review_instruction": "1. Control – Check that Discloser, not Recipient, decides between return and destruction.\n2. Scope – Verify the clause covers all forms of the data (hard copy, electronic, summaries, derivations).\n3. Timing – Insert a clear deadline (10 business days is typical; up to 30 days acceptable).\n4. Certification – Require a signed confirmation from a senior officer or counsel; email PDF is acceptable if “physical writing” seems obsolete.\n5. Archival exception – If allowed, limit to one secured copy for compliance purposes only; ensure ongoing confidentiality and no use.\n6. Back-ups – Permit retention only where (i) technically impracticable to delete, (ii) data is not readily accessible, and (iii) remains subject to the NDA.\n7. Costs – Ensure Recipient bears its own costs for compliance.\n8. Failure to comply – Recommend adding that non-compliance constitutes a material breach with injunctive relief.\n9. Consistency check – Cross-reference any survival, data-protection, or return-of-property clauses elsewhere in the agreement.\n10. Redline review – Flag any deviations listed in the Red Flags column for senior lawyer sign-off.",
    "example_ideal_clause": "On receipt of a written request from Discloser, Recipient will:\n- return to Disclosure all documentation and materials (including any originals, copies, reproductions or summaries) containing Disclosure’s confidential information; or alternatively;\n- at Discloser’s request, destroy the documentation and materials. Recipient will certify in physical writing as soon as possible from the date of the destruction of the documentation and materials that it has complied with these requirements.\n",
    "provision_definition": "This clause requires the Recipient to either return or destroy all Confidential Information received from the Discloser upon request or at the end of the agreement. It ensures that no copies—whether physical, digital, or derivative—are retained beyond the permitted timeframe and that any such return or destruction is certified in writing (or as otherwise agreed).\nIt typically covers:\nOriginal documents\nCopies, summaries, notes, or extracts\nElectronically stored information\nMetadata and derived data\nIt may also include exceptions for:\nArchival copies retained for legal or compliance reasons\nRoutine IT back-ups (if not readily accessible and still subject to confidentiality)\nTypically found near the end of the NDA under sections titled “Return of Materials,” “Destruction of Information,” “Obligations on Termination,” or “Confidentiality – Continuing Obligations.”",
    "example_fallback_clause": "Upon written request from Discloser, Recipient shall, within [15–30] business days, either (a) return all Confidential Information—including originals, copies, extracts, summaries and data stored electronically—or (b) at Discloser’s option, securely destroy it.\nNotwithstanding the foregoing, Recipient may retain one (1) archival copy solely for the purpose of complying with applicable legal, regulatory, or insurance requirements, provided such copy is kept confidential and is not accessed or used for any other purpose. Recipient is not required to delete Confidential Information stored in routine IT backup systems, provided such information is not readily accessible in the ordinary course and remains subject to the confidentiality obligations in this Agreement.\nRecipient shall, within the same period, provide a written confirmation (which may be provided via email by an authorized representative) confirming complete return or destruction of the Confidential Information (excluding any archival or backup copies permitted under this clause)."
  },
  {
    "ideal": "- Covers both term and post-termination period: Restriction applies during the agreement and continues for a defined period afterward (e.g., 6 months).\n- Applies to direct and indirect actions: Prevents circumventing the restriction via recruiters, subsidiaries, etc.\n- Broad engagement restriction: Covers soliciting, offering employment, employing, and contracting (e.g. consulting or freelance roles).\n- Tied to relevant personnel: Limits scope to Discloser’s personnel involved in the purpose of the agreement (i.e. not all employees, but relevant ones).\n- Applies regardless of who initiates: Restriction applies whether Recipient initiates contact or not.\n- Clear duration: Six calendar months is a reasonable and enforceable restriction in many jurisdictions.\n- Defined “personnel”: Best if “personnel” is defined elsewhere to avoid ambiguity (includes employees, contractors, etc.).",
    "clause": "Non-solication ",
    "red_flag": "• Clause is deleted entirely or marked “not acceptable”\n• Covers only current employees, not post-termination\n• Only bars “employment” but allows “contracting” or vice versa\n• No restriction on indirect solicitation (e.g., via recruiter)\n• Carve-outs too broad (e.g., “any public channel”)\n• Applies only during term with no post-termination tail",
    "acceptable": "- Shorter post-termination period: e.g., 3 months instead of 6.\n- Limit to solicitation only: Prohibits actively enticing, but not passive hiring (e.g., employee applies independently).\n- Excludes contractors: Restriction applies to employees only.\n- Mutual restriction: Applies equally to both parties (if the relationship is more balanced).\n- “No hire” instead of “no solicit”: Simpler but less restrictive—allows solicitation but not actual hiring.",
    "is_required": false,
    "clause_definition": "This clause restricts the Recipient from soliciting, hiring, or engaging (either directly or indirectly) any personnel from the Discloser who were involved in the subject matter or purpose of the NDA. It typically applies during the term of the agreement and for a short period after termination (e.g., 3–6 months). It aims to prevent poaching of key team members who may have been exposed to sensitive information or commercial strategies during the relationship. ",
    "review_instruction": "1. Ensure the clause prevents both direct and indirect solicitation or hiring of Discloser’s personnel.\n2. Confirm it applies during the agreement and for a reasonable period after (6 months preferred; 3 months acceptable).\n3. Look for coverage of all forms of engagement (employment, contracting, consulting).\n4. Ensure it targets personnel involved in the purpose – not necessarily the entire company.\n5. A fallback may limit to active poaching only – ensure that general recruitment is excluded only with proper guardrails.\n6. Avoid vague terms or loopholes like “through public means” unless carefully defined.\n7. Flag any attempt to remove the clause or shorten the protection period too aggressively.\n8. Consider alignment with any separate non-solicitation or non-poach obligations elsewhere in the agreement.",
    "example_ideal_clause": "Recipient will not, during the currency of this agreement or for a period of six calendar months following termination, directly or indirectly solicit, offer employment to, employ or contract in any manner with any of Discloser’s personnel involved in the purpose.",
    "provision_definition": "This clause restricts the Recipient from soliciting, hiring, or engaging (either directly or indirectly) any personnel from the Discloser who were involved in the subject matter or purpose of the NDA. It typically applies during the term of the agreement and for a short period after termination (e.g., 3–6 months). It aims to prevent poaching of key team members who may have been exposed to sensitive information or commercial strategies during the relationship. ",
    "example_fallback_clause": "Recipient will not, during the currency of this agreement or for a period of three calendar months following termination, directly or indirectly solicit, offer employment to, employ or contract in any manner with any of Discloser’s personnel who were materially involved in the purpose of this agreement.\nFor the avoidance of doubt, this restriction shall not apply to (i) general job postings not targeted at such personnel, or (ii) personnel who independently apply to publicly advertised roles without prior solicitation by Recipient."
  },
  {
    "ideal": "- Key elements of a strong confidential information ownership and IP rights clause:\n- Clear ownership statement: Confidential information remains the exclusive property of the Discloser.\n- No transfer of rights: Expressly states there is no grant or transfer of:\nOwnership\nLicense\nRight, title, or interest in the confidential information.\nCovers all forms of transfer: Includes transfers by sale, license, assignment, or otherwise.\nProtects Discloser’s IP: Clarifies no rights are granted to:\nPatents\nTrademarks\nCopyrights\nOther intellectual property belonging to Discloser or its licensors.\n- Covers both disclosed and underlying IP: Ensures that both the confidential information and any associated IP remain protected.\n- No implied rights: Prevents Recipient from claiming rights through use, access, or implication.",
    "clause": "Ownership",
    "red_flag": "• Clause missing entirely\n• Ambiguity around ownership (e.g., “Recipient may use…” without restriction)\n• Any implied license to develop, reverse-engineer, benchmark, or derive insights\n• Limiting ownership to “materials marked confidential” only\n• Clause silent on IP derived from or based on the Confidential Information",
    "acceptable": "- Limited license for evaluation: Grants Recipient a non-exclusive, revocable, non-transferable license to use Confidential Information solely for the permitted purpose.\n- Excludes reference to Discloser’s licensors: Protects Discloser’s own IP, but not necessarily third-party IP.\n- More general IP language: Uses broader terms like “proprietary rights” instead of naming all IP types.\n- No mention of trademarks: Common if no branded materials are being shared.\n- Silent on IP but reinforced elsewhere in the agreement (e.g., IP clause or annex).",
    "is_required": true,
    "clause_definition": "This clause clarifies that all Confidential Information remains the property of the Discloser and that no rights—express or implied—are transferred to the Recipient. It reinforces that receiving Confidential Information does not grant any license to use the Discloser’s intellectual property, inventions, or trade secrets for commercial gain or derivative development. It’s a key IP protection clause.\nWhere to Find It: Commonly found in sections titled “Ownership,” “Intellectual Property,” “No License,” or within the Confidentiality provisions.",
    "review_instruction": "1. Confirm that the clause states Confidential Information remains Discloser’s property—always.\n2. Make sure it explicitly says no rights, title, or interest are granted.\n3. Look for language that disclaims licenses of any kind (sale, license, implied, etc.).\n4. Ensure the clause includes IP rights like patents, trademarks, copyrights, trade secrets, and optionally “know-how”.\n5. Watch out for implied usage rights, especially in commercial or tech contexts—flag vague phrases like “Recipient may use…”\n6. Accept fallback versions if the meaning is clear but the phrasing is less legalistic.\n7. Confirm it’s not limited only to information “marked confidential.”\n8. This clause often appears in the Confidentiality, Ownership, or IP section—check surrounding language for consistency.",
    "example_ideal_clause": "Confidential information will remain Discloser’s exclusive property and there is no granting or conferring, whether by sale, license or otherwise, to Recipient of any right, title or interest to or in any of the confidential information disclosed, nor in any of the patents, trademarks, copyrights or other intellectual property rights of Discloser or Discloser’s licensors.",
    "provision_definition": "This clause clarifies that all Confidential Information remains the property of the Discloser and that no rights—express or implied—are transferred to the Recipient. It reinforces that receiving Confidential Information does not grant any license to use the Discloser’s intellectual property, inventions, or trade secrets for commercial gain or derivative development. It’s a key IP protection clause.\nWhere to Find It: Commonly found in sections titled “Ownership,” “Intellectual Property,” “No License,” or within the Confidentiality provisions.",
    "example_fallback_clause": "Confidential Information will remain Discloser’s exclusive property, and Recipient acknowledges that there is no granting or conferring, whether by sale, license or otherwise, to Recipient of any right, title or interest to or in any of the Confidential Information disclosed, except as strictly necessary to evaluate or use the Confidential Information for the permitted purpose under this Agreement, nor in any of the patents, trademarks, copyrights or other intellectual property rights of Discloser or Discloser’s licensors."
  },
  {
    "ideal": "- Discloser makes no representations or warranties: Clearly states that no warranty or guarantee is given regarding the accuracy, completeness, or reliability of the confidential information.\n- “As is” and “with all faults” language: Reinforces that information is provided without any assurances and at the recipient’s risk.\n- Disclaimer of liability: Explicitly excludes liability for errors, omissions, or inaccuracies in the confidential information.\n- Recipient’s responsibility to verify: Places the burden on the Recipient to confirm accuracy and suitability for its use.\n- Exclusion of statutory warranties: Disclaims all implied warranties, including:\n- Merchantability\n- Fitness for a particular purpose\n- Non-infringement\n- Covers all relevant parties: Protects not just the Discloser, but also its employees, consultants, and third parties.\n- Clarity that this is not a commercial guarantee: Reinforces that disclosure is informational, not transactional.",
    "clause": "Accuracy of the confidential information",
    "red_flag": "• Clause omitted entirely.\n• Discloser deemed liable for errors or omissions in the Confidential Information.\n• Clause implies Confidential Information is warranted as complete or accurate.\n• Recipient allowed to rely on Confidential Information for commercial, regulatory, or legal use without duty to verify.\n• Implied obligations of merchantability or fitness not expressly disclaimed.",
    "acceptable": "- Softened language: e.g., “to the best of Discloser’s knowledge, the information is accurate” (still disclaims strict liability).\n- Excludes only consequential damages: May still allow direct liability for willful misconduct or gross negligence.\n- Silent on fitness for purpose: Implied only by jurisdictional law but not contractually disclaimed.\n- Narrower exclusion: Liability disclaimer applies only to certain types of confidential information (e.g., forward-looking financials or projections).",
    "is_required": true,
    "clause_definition": "This clause ensures that the Discloser makes no promises about the accuracy, completeness, or reliability of the Confidential Information being shared. It states that the information is provided “as is”, and the Discloser will not be liable if it turns out to be wrong, misleading, or incomplete. It shifts the risk and burden to the Recipient to verify and evaluate any information received.\nWhere to Find It: Typically located at the end of the NDA under sections titled “Disclaimer,” “No Warranty,” “Limitation of Liability,” or “Miscellaneous.”",
    "review_instruction": "1. This clause should protect the Discloser by clearly stating that Confidential Information is shared without warranties of any kind.\n2. Ensure it includes a disclaimer of liability for errors, omissions, or inaccuracies.\n3. Look for “as is” and “with all faults” language — this signals strong disclaimer of responsibility.\n4. Confirm the clause places the responsibility on the Recipient to verify any information provided.\n5. Acceptable fallback may soften tone but should still disclaim implied warranties.\n6. Flag any clause that gives the impression the Discloser is guaranteeing the accuracy or usability of the information.\n7. Be cautious of any attempt to shift liability to the Discloser for how the information is used by the Recipient.\n8. This clause is often found at the end of the NDA in a “No Warranty,” “Disclaimer,” “Limitation of Liability,” or “Miscellaneous” section.",
    "example_ideal_clause": "Both parties agree that the confidential information provided is believed by Discloser to be generally accurate and correct. However, in no event will Discloser, its employees, consultants or third parties be liable for errors, omissions or inaccuracies of any kind in the confidential information and Recipient will be responsible for verifying the accuracy and correctness of the confidential information disclosed. No warranty of any kind is given under this agreement regarding the confidential information, it being provided as is and with all faults, and any guarantees or warranties (including warranties of merchantability and fitness for purpose and non-infringement) are excluded.",
    "provision_definition": "This clause ensures that the Discloser makes no promises about the accuracy, completeness, or reliability of the Confidential Information being shared. It states that the information is provided “as is”, and the Discloser will not be liable if it turns out to be wrong, misleading, or incomplete. It shifts the risk and burden to the Recipient to verify and evaluate any information received.\nWhere to Find It: Typically located at the end of the NDA under sections titled “Disclaimer,” “No Warranty,” “Limitation of Liability,” or “Miscellaneous.”",
    "example_fallback_clause": "Both parties agree that the Confidential Information provided is believed by Discloser to be generally accurate and correct. However, in no event will Discloser, its employees, consultants or third parties be liable for errors, omissions or inaccuracies of any kind in the Confidential Information, and Recipient will be responsible for verifying the accuracy and correctness of the Confidential Information disclosed.\nTo the fullest extent permitted by applicable law, no warranty of any kind is given under this agreement regarding the Confidential Information, it being provided “as is” and without warranties, express or implied, including but not limited to any warranties of merchantability, fitness for a particular purpose, or non-infringement."
  },
  {
    "ideal": "- Comprehensive indemnity: Recipient agrees to indemnify, defend, and hold harmless the Discloser and its personnel.\n- Covers full scope of losses: Includes loss, damage, costs, expenses, and attorneys’ fees, specifically on a \"attorney and own client\" basis (broadest standard).\n- Clear triggers for indemnity: Includes:\n- Breach of confidentiality obligations by Recipient’s personnel\n- Any breach of the agreement’s terms\n- Wilful misconduct or fraud by Recipient or its personnel\n- Covers indirect as well as direct loss: Ensures protection from both direct and indirect consequences.\n- Extends to personnel: Protects the Discloser’s employees, contractors, officers, etc. – not just the entity.\n- No requirement for final adjudication: Indemnity may be triggered on allegation or reasonable claim, not just proven liability.\n- Standalone remedy: Does not limit Discloser’s rights to other remedies (e.g. injunction, damages, specific performance).",
    "clause": "Indemnity",
    "red_flag": "• Indemnity clause deleted entirely\n• Limits indemnity to final court judgment only\n• Indemnity applies only to “direct damages,” leaving ambiguity\n• Discloser must prove gross negligence or intent to claim indemnity\n• Recipient's liability capped or tied to insurance availability",
    "acceptable": "- Limit to direct losses: Excludes consequential or indirect damages.\n- Cap on liability: Indemnity is subject to a monetary cap, often linked to contract value or insurance.\n- Standard attorneys’ fees: Removes \"attorney and own client\" basis and replaces with \"reasonable legal fees\".\n- Limited scope: Indemnity applies only to breaches of confidentiality, not all breaches of the agreement.\n- Carve-outs for negligence: Omits liability for simple negligence unless gross or wilful.\n- Reciprocal indemnity: Where both parties may share responsibility and risk.",
    "is_required": true,
    "clause_definition": "This clause requires the Recipient to compensate (indemnify) the Discloser for any losses caused by the Recipient’s (or its personnel’s) breach of the NDA, failure to maintain confidentiality, or wilful misconduct/fraud. It shifts financial and legal liability to the Recipient if something goes wrong because they mishandle the Discloser’s information.\nIt typically includes:\nAll resulting damages and costs\nLegal fees (broad or capped)\nBoth direct and indirect causes\nProtection for the Discloser’s employees, contractors, and affiliates\nWhere to Find It: Usually found near the end of the NDA in a section titled “Indemnity,” “Liability,” or “Miscellaneous Provisions.”",
    "review_instruction": "1. Ensure the clause obligates Recipient to indemnify for breaches of confidentiality and other NDA provisions.\n2. It should also cover Recipient’s personnel and include wilful misconduct or fraud as standalone indemnifiable acts.\n3. Confirm it applies to any loss, damage, cost, or expense, including attorney fees.\n4. “Attorney and own client basis” means full fee recovery, not just court-awarded costs — maintain if possible.\n5. If fallback version narrows the scope (e.g., excludes consequential loss), make sure the core confidentiality breach is still covered.\n6. Accept if Recipient requests standard indemnity terms like notice, control of defense, and cooperation.\n7. Flag any complete removal or if indemnity is unreasonably watered down (e.g., vague, overly conditional).\n8. This clause is often in the Indemnity, Liability, or General Terms section of the NDA.",
    "example_ideal_clause": "Recipient agrees to indemnify, defend and hold Discloser (and Discloser’s personnel) harmless against any and all loss, damage (including attorneys' fees on an attorney and own client basis), costs and expenses that Discloser may suffer or incur arising directly or indirectly from:\na failure by Recipient’s personnel to abide by their obligations of confidentiality and non-disclosure; \nany breach of the provisions of this agreement; or \nany wilful misconduct or fraud by Recipient or Recipient’s personnel.\n",
    "provision_definition": "This clause requires the Recipient to compensate (indemnify) the Discloser for any losses caused by the Recipient’s (or its personnel’s) breach of the NDA, failure to maintain confidentiality, or wilful misconduct/fraud. It shifts financial and legal liability to the Recipient if something goes wrong because they mishandle the Discloser’s information.\nIt typically includes:\nAll resulting damages and costs\nLegal fees (broad or capped)\nBoth direct and indirect causes\nProtection for the Discloser’s employees, contractors, and affiliates\nWhere to Find It: Usually found near the end of the NDA in a section titled “Indemnity,” “Liability,” or “Miscellaneous Provisions.”",
    "example_fallback_clause": "Recipient agrees to indemnify, defend and hold Discloser (and Discloser’s personnel) harmless against any and all direct loss, damage (including reasonable attorneys' fees), costs and expenses that Discloser may suffer or incur arising directly from:\n(a) a failure by Recipient’s personnel to abide by their obligations of confidentiality and non-disclosure;\n(b) any material breach of the provisions of this agreement; or\n(c) any wilful misconduct or fraud by Recipient or Recipient’s personnel,\nprovided that Discloser promptly notifies Recipient of any such claim and allows Recipient to control the defense and settlement of the claim, with reasonable cooperation."
  },
  {
    "ideal": "- Jurisdiction-specific compliance: Requires the Recipient to comply with all applicable laws of the Discloser’s country (e.g., ${country}) that apply to:\nThe confidential information itself, and\nAny product, process, or service derived from the confidential information.\n- Covers export control regulations: Includes compliance with:\nEnd-user,\nEnd-use, and\nDestination restrictions\nimposed by the relevant authorities (e.g., export control agencies, trade regulators).\n- Applies to derivatives and outputs: Covers not just the original data, but any resulting outputs (e.g., engineered products, tools, AI models, software).\n- Broad scope of responsibility: The Recipient must ensure it does not export, re-export, or transfer sensitive information in violation of law.\n- Neutral phrasing: Doesn’t imply Discloser is exporting—focuses on Recipient’s compliance obligations.\n- References “relevant government”: Avoids needing to name specific agencies (e.g., OFAC, BIS), keeping it general but enforceable.",
    "clause": "Compliance with Laws",
    "red_flag": "• Clause omitted entirely\n• Fails to reference export controls, sanctions, or government-issued restrictions\n• Only applies to “Confidential Information” but not to resulting products/services\n• Recipient may limit obligation to only “known” restrictions or public notices\n• Allows transfer of data without government approval or license when one may be required",
    "acceptable": "- Mutual compliance clause: Both parties agree to comply with applicable laws.\n- Territory-specific limitation: Applies only to exports from Recipient’s country, not Discloser’s.\n- Limited to known restrictions: E.g., Recipient complies only with restrictions notified in writing by Discloser.\n- General legal compliance: Instead of export-specific language, clause requires adherence to “all applicable laws, rules, and regulations”.\n- Compliance “to the extent applicable”: Gives Recipient some discretion depending on whether export laws actually apply to them.",
    "is_required": false,
    "clause_definition": "This clause requires the Recipient to comply with export control laws and sanctions regimes that govern the handling, transmission, or use of Confidential Information, especially when such information may be subject to national security, defense, or trade restrictions. It applies not just to the information itself, but also to derivative products, services, or processes developed from it.\nIt often addresses:\nU.S. Export Administration Regulations (EAR)\nInternational Traffic in Arms Regulations (ITAR)\nEU dual-use regulations\nOFAC or UN sanctions\nCross-border data transfer restrictions\nWhere to Find It: Usually located in the “Compliance with Laws,” “Export Control,” or “Miscellaneous” section of an NDA — or sometimes buried in the boilerplate.",
    "review_instruction": "1. Ensure the clause obligates Recipient to comply with applicable export control laws and government-issued restrictions — especially those of the Discloser’s country (e.g., U.S. EAR/ITAR, EU Dual Use).\n2. Confirm the clause extends to any product, process, or service derived from the Confidential Information.\n3. Look for references to end-use, end-user, and destination restrictions — these are standard compliance triggers.\n4. Accept fallbacks that generalize the governing jurisdiction but still mandate compliance.\n5. Watch for complete omission or watered-down language (e.g., “reasonable efforts,” “where applicable”).\n6. Flag if the Recipient operates in or exports to sanctioned countries or restricted industries.\n7. This clause is especially critical in tech, defense, AI, or regulated data disclosures.\n8. Usually found in “Compliance,” “Export Control,” or “Miscellaneous” sections of the NDA.",
    "example_ideal_clause": "Recipient agrees to comply with ${country}’s laws that apply to the confidential information, or any product, process or service that is the direct product of the confidential information, as well as end-user, end-use and destination restrictions issued by the relevant government.",
    "provision_definition": "This clause requires the Recipient to comply with export control laws and sanctions regimes that govern the handling, transmission, or use of Confidential Information, especially when such information may be subject to national security, defense, or trade restrictions. It applies not just to the information itself, but also to derivative products, services, or processes developed from it.\nIt often addresses:\nU.S. Export Administration Regulations (EAR)\nInternational Traffic in Arms Regulations (ITAR)\nEU dual-use regulations\nOFAC or UN sanctions\nCross-border data transfer restrictions\nWhere to Find It: Usually located in the “Compliance with Laws,” “Export Control,” or “Miscellaneous” section of an NDA — or sometimes buried in the boilerplate.",
    "example_fallback_clause": "Recipient agrees to comply with all applicable laws, including export control and sanctions regulations of ${country} and any other relevant jurisdiction, that apply to the Confidential Information or any product, process or service that is the direct product of the Confidential Information, as well as any applicable end-user, end-use and destination restrictions issued by the relevant government authorities."
  },
  {
    "ideal": "Express incorporation by reference: Clearly states that the Privacy Notice (or Policy) is part of the agreement and binding on the parties.\nClarity on applicable version: Specifies whether it is the version current at the time of agreement or as updated from time to time.\nLink or reference to location: Ideally includes a URL or attachment reference so the parties can access the exact document.\nConsistency with data terms: The Privacy Notice should align with the agreement’s terms on data use, confidentiality, and processing.\nScope clarity: Makes clear the Privacy Notice applies only to personal data shared under or in connection with the agreement.\nNon-conflict language: Where applicable, clarifies that if there's a conflict between the Privacy Notice and the agreement, the agreement prevails (or vice versa).\nMutual or one-sided?: States whether the Privacy Notice governs data processing by both parties or just the Recipient.",
    "clause": "Privacy Policy",
    "red_flag": "• No reference to privacy or data protection at all\n• NDA permits collection/use of personal data without restriction\n• No alignment with applicable laws (e.g., GDPR, POPIA, CCPA)\n• No mention of retention, security, or data subject rights\n• Conflicting terms between the NDA and external privacy policy",
    "acceptable": "Reference to a general privacy policy (e.g. on a website), without incorporating it fully into the agreement.\nApplies only to one party – e.g., only Recipient agrees to comply with Discloser’s privacy terms.\nNo attached version – the policy exists, but there’s no snapshot or stable reference (could change unilaterally).\n“Privacy terms available upon request” – Requires extra effort to obtain and review.\nSilent on conflicts – No clarity on what happens if there’s inconsistency between Privacy Notice and agreement.",
    "is_required": true,
    "clause_definition": "This clause confirms that the terms of the Discloser’s Privacy Notice or Privacy Policy apply to the NDA. It governs how personal data shared under the agreement must be handled—ensuring that the Recipient processes any personal information lawfully, securely, and only for the permitted purpose.\nIf the Privacy Policy is not attached or hyperlinked, it must be requested and reviewed to confirm it complies with relevant data protection laws (such as GDPR, CCPA, or POPIA).\nThe clause may either:\nIncorporate a full Privacy Policy by reference (ideal), or\nContain a summary of key privacy obligations within the NDA itself (fallback)\nIt protects the Discloser from unauthorized use, retention, or disclosure of personal data, and helps both parties meet their legal compliance obligations.",
    "review_instruction": "1. Check whether the clause references or incorporates a Privacy Notice or Privacy Policy. It should be accessible via link or attached.\n2. If the Privacy Policy is not publicly available or linked, you must request a copy from the Discloser.\n3. Once obtained, review the Privacy Policy against your team’s privacy policy playbook to ensure it:\n– Aligns with GDPR, CCPA, and other applicable laws\n– Accurately describes data use, retention, and security\n– Includes data subject rights and restrictions on onward transfers\n4. If no policy is available and no fallback clause is included, escalate as a compliance gap.\n5. Confirm any fallback clause in the NDA includes:\n– Compliance with applicable privacy laws\n– Purpose limitation (use only for NDA purpose)\n– Security safeguards\n– Prohibition on further disclosure or sale\n6. Coordinate with privacy/compliance lead if the information involves sensitive data, cross-border transfers, or regulated industries.",
    "example_ideal_clause": "The terms of the Privacy Notice are also applicable to this agreement.",
    "provision_definition": "This clause confirms that the terms of the Discloser’s Privacy Notice or Privacy Policy apply to the NDA. It governs how personal data shared under the agreement must be handled—ensuring that the Recipient processes any personal information lawfully, securely, and only for the permitted purpose.\nIf the Privacy Policy is not attached or hyperlinked, it must be requested and reviewed to confirm it complies with relevant data protection laws (such as GDPR, CCPA, or POPIA).\nThe clause may either:\nIncorporate a full Privacy Policy by reference (ideal), or\nContain a summary of key privacy obligations within the NDA itself (fallback)\nIt protects the Discloser from unauthorized use, retention, or disclosure of personal data, and helps both parties meet their legal compliance obligations.",
    "example_fallback_clause": "The terms of the Privacy Notice are also applicable to this agreement. Alternatively, the parties agree to comply with applicable data protection laws (including GDPR, where applicable) in relation to any personal data exchanged under this agreement. Personal data shall only be used for the purpose of fulfilling obligations under this NDA, and each party shall implement appropriate technical and organizational measures to protect such data."
  },
  {
    "ideal": "",
    "clause": "Breach, dispute and termination",
    "red_flag": "• No reference to equitable relief or injunctive rights\n• Recipient bears no onus to prove disclosure was authorized\n• NDA is silent on post-termination obligations\n• One party gets unilateral right to choose arbitration venue\n• No escalation process for resolving disputes\n• NDA can be terminated immediately without notice\n• Arbitration is binding with no fair recourse",
    "acceptable": "Reference to a general privacy policy (e.g. on a website), without incorporating it fully into the agreement.\nApplies only to one party – e.g., only Recipient agrees to comply with Discloser’s privacy terms.\nNo attached version – the policy exists, but there’s no snapshot or stable reference (could change unilaterally).\n“Privacy terms available upon request” – Requires extra effort to obtain and review.\nSilent on conflicts – No clarity on what happens if there’s inconsistency between Privacy Notice and agreement.",
    "is_required": true,
    "clause_definition": "This set of clauses provides procedural and protective guardrails for:\nEquitable relief: Allowing the Discloser to seek urgent court intervention (e.g., injunction) if the Recipient misuses or threatens to misuse Confidential Information.\nTermination: Allowing either party to end the NDA with written notice (typically 30 days), while ensuring confidentiality survives.\nDispute resolution: Establishing a tiered process—negotiation → mediation → arbitration—to resolve conflicts without immediate litigation.\nBurden of proof: In some cases, placing the obligation on the Recipient to justify a disputed disclosure.\nThese clauses are critical for enforcing the NDA, containing risk, and avoiding escalation.\nWhere to Find It: Usually appears at the end of the agreement in sections titled: “Termination”“Equitable Relief” or “Remedies” “Governing Law and Dispute Resolution” “Miscellaneous”",
    "review_instruction": "1. Confirm there’s a right to injunctive relief — especially in case of unauthorized use or disclosure of Confidential Information.\n2. Ensure Recipient bears the burden of proving authorized disclosure (this is rare but strong).\n3. Termination clause should provide reasonable notice (e.g., 30 calendar days); flag if unilateral or ambiguous.\n4. Check that confidentiality obligations survive termination, including return or destruction of data.\n5. Dispute resolution must follow a tiered process (negotiate → mediate → arbitrate), unless the parties clearly prefer litigation.\n6. Arbitration must be in a mutually agreed and accessible venue — not imposed unilaterally.\n7. If arbitration is binding, confirm if local law allows appeals or review.\n8. Clause is usually found in the Termination, Dispute Resolution, or Miscellaneous section.\n9. Escalate to lead counsel if injunctive relief is excluded, especially in high-IP or high-risk deals.",
    "example_ideal_clause": "If Recipient breaches or threatens to breach this agreement, Discloser will be entitled to seek injunctive, protective or other appropriate relief in any court of competent jurisdiction restraining Recipient from breaching the terms or from disclosing or using any confidential information to any person. \nIn the event of a dispute arising under this agreement relating to a disclosure of confidential information, the onus of proof will be on Recipient to show that the Disclosure was authorised in accordance with the terms of this agreement.\nA party may terminate this agreement on 30 calendar days written notice to the other party.\nRecipient will continue to be bound by Recipient’s obligations under clause ‎5 of this agreement with regard to all confidential information Discloser discloses despite termination of the agreement, the completion of the purpose, return or destruction of confidential information.\nEither party may inform the other in writing if there is a dispute. The parties must first try to negotiate to end the dispute, then enter into mediation if negotiation fails, and finally go to arbitration if mediation fails. If they go to arbitration, they will agree in writing on a recognised and appropriate forum for arbitration that is accessible to both parties.\n",
    "provision_definition": "This set of clauses provides procedural and protective guardrails for:\nEquitable relief: Allowing the Discloser to seek urgent court intervention (e.g., injunction) if the Recipient misuses or threatens to misuse Confidential Information.\nTermination: Allowing either party to end the NDA with written notice (typically 30 days), while ensuring confidentiality survives.\nDispute resolution: Establishing a tiered process—negotiation → mediation → arbitration—to resolve conflicts without immediate litigation.\nBurden of proof: In some cases, placing the obligation on the Recipient to justify a disputed disclosure.\nThese clauses are critical for enforcing the NDA, containing risk, and avoiding escalation.\nWhere to Find It: Usually appears at the end of the agreement in sections titled: “Termination”“Equitable Relief” or “Remedies” “Governing Law and Dispute Resolution” “Miscellaneous”",
    "example_fallback_clause": "If Recipient breaches or threatens to breach this agreement, Discloser may be entitled to seek injunctive, protective or other appropriate relief in any court of competent jurisdiction restraining Recipient from breaching the terms or from disclosing or using any confidential information.\nIn the event of a dispute relating to a disclosure of confidential information, the onus of proof will be determined in accordance with applicable law.\nA party may terminate this agreement on 15 days’ written notice to the other party.\nRecipient will continue to be bound by confidentiality obligations under clause 5 with respect to Confidential Information disclosed before termination, despite termination, completion of the purpose, or destruction of such information.\nEither party may notify the other of a dispute. The parties will use good faith efforts to resolve the dispute through negotiation, and if unsuccessful, will refer the matter to non-binding mediation, followed by binding arbitration. The parties agree to determine a mutually acceptable arbitration forum at the relevant time."
  },
  {
    "ideal": "- Reference to a general privacy policy (e.g. on a website), without incorporating it fully into the agreement.\n- Applies only to one party – e.g., only Recipient agrees to comply with Discloser’s privacy terms.\n- No attached version – the policy exists, but there’s no snapshot or stable reference (could change unilaterally).\n- “Privacy terms available upon request” – Requires extra effort to obtain and review.\n- Silent on conflicts – No clarity on what happens if there’s inconsistency between Privacy Notice and agreement.",
    "clause": "Notices and domicile",
    "red_flag": "• No notice clause at all\n• No physical address designated for service (domicilium)\n• No mechanism for changing addresses\n• Delivery only valid on signature or read receipt\n• Only email accepted, with no fallback\n• Notices considered delivered only when acknowledged by recipient",
    "acceptable": "- Reference to a general privacy policy (e.g. on a website), without incorporating it fully into the agreement.\n- Applies only to one party – e.g., only Recipient agrees to comply with Discloser’s privacy terms.\n- No attached version – the policy exists, but there’s no snapshot or stable reference (could change unilaterally).\n- “Privacy terms available upon request” – Requires extra effort to obtain and review.\n- Silent on conflicts – No clarity on what happens if there’s inconsistency between Privacy Notice and agreement.",
    "is_required": true,
    "clause_definition": "This clause sets out how the parties will send and receive formal communications, such as:\nTermination notices\nLegal process (e.g., service of summons)\nDispute notifications\nAmendments or consents under the NDA\nIt includes:\nPermitted delivery methods (email, hand, post)\nThe parties’ chosen legal service address (domicilium)\nHow and when notice is considered delivered\nA rule that if a notice is actually received, it counts even if not perfectly sent\nIt ensures that formal communications are trackable, and avoids disputes about whether a notice was validly delivered.\nWhere to Find It: Usually appears in the Notices, Miscellaneous, or General Provisions section of an NDA.",
    "review_instruction": "1. Check that all acceptable notice methods are listed — especially email and physical delivery.\n2. Confirm both parties have chosen a legal service address (domicilium) — typically listed in the agreement header or annex.\n3. There should be a way to change addresses with prior notice (ideally 14 days).\n4. Make sure the clause covers both deemed delivery (based on proof of sending) and actual receipt (if evidence exists).\n5. If domicilium isn’t explicitly mentioned, check that legal delivery addresses are still clearly specified.\n6. Flag any clause that requires recipient acknowledgement (e.g., read receipt or signature) as a condition of valid delivery — this is a risk.\n7. Ensure email notices are acceptable — most commercial NDAs allow this now.\n8. Clause typically sits in the Notices or Miscellaneous section.",
    "example_ideal_clause": "Notices. The parties will send all notices, authorisations, disclosures, acknowledgements, or requests by hand delivery, prepaid registered post, fax, or email to an address or number given in this agreement.\nService (delivery) address for legal documents. Each party chooses its street addresses and numbers as its domicilium citandi et executandi (its address for the service of any document used in legal action) for this agreement.\nChange of addresses or numbers. Each party may change the addresses or numbers in the specific terms to any other addresses or numbers in the same country by writing to the other party 14 days before the change.\nDeemed delivery. Notice will be considered to be delivered on the date shown on any hand-delivered, prepaid registered post, courier, fax or email confirmation of delivery.\nNotice actually received. If a party actually receives any notice or other communication, this will be good enough.",
    "provision_definition": "This clause sets out how the parties will send and receive formal communications, such as:\nTermination notices\nLegal process (e.g., service of summons)\nDispute notifications\nAmendments or consents under the NDA\nIt includes:\nPermitted delivery methods (email, hand, post)\nThe parties’ chosen legal service address (domicilium)\nHow and when notice is considered delivered\nA rule that if a notice is actually received, it counts even if not perfectly sent\nIt ensures that formal communications are trackable, and avoids disputes about whether a notice was validly delivered.\nWhere to Find It: Usually appears in the Notices, Miscellaneous, or General Provisions section of an NDA.",
    "example_fallback_clause": ""
  },
  {
    "ideal": "- No delegation or assignment without consent: Neither party may assign its rights or delegate its duties, in whole or in part, without prior written consent.\n- Clear exception for Discloser: Discloser may freely assign the agreement to a successor or purchaser of its business (or relevant assets).\n- Scope of restriction: Applies to both assignment of rights (e.g., benefit under the contract) and delegation of obligations (e.g., performance of duties).\n- Covers partial assignments: Prevents sneaky transfers of parts of the agreement or benefit.\n- Business continuity: Ensures Discloser can assign during mergers, acquisitions, asset sales, or internal restructures.\n- No need for Recipient’s consent to Discloser’s assignment to successor.\n- Optional addition: Includes a requirement that any assignment must not adversely affect the non-assigning party’s rights.- ",
    "clause": "Assignment",
    "red_flag": "• Recipient is allowed to assign freely or unilaterally\n• Clause is missing entirely\n• Assignment allowed to affiliates without oversight\n• No restriction on delegation of duties (e.g., Recipient outsourcing handling of confidential info)\n• Any clause that removes Discloser’s ability to restrict downstream recipients",
    "acceptable": "- Mutual assignment with notice: Allows assignment by either party with prior written notice, not consent.\n- Assignment only with consent, not unreasonably withheld: Adds some flexibility for business needs.\n- Assignment allowed with conditions: E.g., assignee must agree in writing to be bound by the agreement.\n- Assignment limited to change of control: E.g., either party may assign in connection with a merger, acquisition, or reorganization.\n- Delegation permitted to affiliates: With or without prior notice, especially for operational purposes.",
    "is_required": true,
    "clause_definition": "This clause restricts either party — particularly the Recipient — from transferring their rights or obligations under the NDA to another entity without consent. It ensures that the control over confidentiality and obligations remains with the original parties unless the Discloser approves a transfer or is acquired.\nThe clause typically:\nProhibits delegation (e.g., subcontracting data processing)\nRestricts assignment without approval\nAllows the Discloser to assign in the event of M&A or asset transfer\nPrevents unwanted third parties from gaining access to confidential information\nWhere to Find It: This clause is usually in the Miscellaneous, Assignment, or General Provisions section.",
    "review_instruction": "1. Confirm that neither party may assign or delegate under the agreement without consent — this protects against third parties inheriting rights to confidential data.\n2. The Discloser is typically allowed to assign the NDA to a successor, acquirer, or purchaser of assets — make sure this right is preserved.\n3. Check if the Recipient is granted any assignment rights — these should be tightly controlled or require prior consent.\n4. If the clause is missing, flag it as high risk, particularly in strategic or cross-border deals.\n5. Ensure the clause restricts delegation of obligations, not just assignment of rights — especially important if Recipient might outsource or sub-process.\n6. You’ll usually find this in the Miscellaneous, Assignment, or General Terms section.\n7. Escalate if you see automatic assignment to affiliates or any corporate group — this can undermine confidentiality control.",
    "example_ideal_clause": "No party may delegate its duties under this agreement or assign its rights under this agreement, in whole or in part. Discloser may assign this agreement to any successor or purchaser of its business or some of its assets.",
    "provision_definition": "This clause restricts either party — particularly the Recipient — from transferring their rights or obligations under the NDA to another entity without consent. It ensures that the control over confidentiality and obligations remains with the original parties unless the Discloser approves a transfer or is acquired.\nThe clause typically:\nProhibits delegation (e.g., subcontracting data processing)\nRestricts assignment without approval\nAllows the Discloser to assign in the event of M&A or asset transfer\nPrevents unwanted third parties from gaining access to confidential information\nWhere to Find It: This clause is usually in the Miscellaneous, Assignment, or General Provisions section.",
    "example_fallback_clause": "No party may delegate its duties under this agreement or assign its rights under this agreement, in whole or in part, without the prior written consent of the other party.\nHowever, Discloser may assign this agreement, without consent, to any successor or purchaser of its business or substantially all of its assets.\nRecipient may not assign or transfer this agreement without such consent, except to an affiliate as part of a bona fide internal corporate reorganisation, provided Discloser is notified in advance."
  },
  {
    "ideal": "- Entire Agreement: States this is the entire and final agreement between the parties on the subject.\n- Supersedes all prior discussions, drafts, or understandings (oral or written).\n- No Future Agreement Obligations\n- Clarifies that no obligation exists to pursue a future relationship.\n- Tangible confidential information must be returned unless a new written agreement is signed.\n- Any changes must be:\nIn writing\nSigned by both parties\nPreferably by authorised signatories with handwritten signature.\nNo waiver unless:\nIn writing\nDoes not arise by delay, silence, or past indulgence.\nSeverability: Invalid or unenforceable terms can be severed.\nRemainder of the agreement remains enforceable if the core purpose is not altered.\n- Governing Law: The agreement is governed by the laws of a specific country (e.g., ${country}). Ideally the Discloser’s jurisdiction\n- Jurisdiction: Recipient submits to the lowest competent court of the Discloser’s jurisdiction.\n- Clause is non-exclusive, preserving Discloser’s flexibility to litigate elsewhere.\n- Non-Exclusivity: Discloser can engage with other parties freely – no exclusivity is implied.\n- Costs: Each party bears its own costs related to negotiation and execution of the agreement.\nPublicity\nRecipient cannot make any public or informal announcement (e.g. press, blog, social) without Discloser’s prior written consent.",
    "clause": "General",
    "red_flag": "Mentions or relies on verbal agreements.\nBroad carve-outs for informal understandings or “course of dealing”.\nConflicts with existing commercial terms without clarifying hierarchy.",
    "acceptable": "- Entire Agreement: States this is the entire and final agreement between the parties on the subject.\n- Supersedes all prior discussions, drafts, or understandings (oral or written).\n- No Future Agreement Obligations\n- Clarifies that no obligation exists to pursue a future relationship.\n- Tangible confidential information must be returned unless a new written agreement is signed.\n- Any changes must be:\nIn writing\nSigned by both parties\nPreferably by authorised signatories with handwritten signature.\nNo waiver unless:\nIn writing\nDoes not arise by delay, silence, or past indulgence.\nSeverability: Invalid or unenforceable terms can be severed.\nRemainder of the agreement remains enforceable if the core purpose is not altered.\n- Governing Law: The agreement is governed by the laws of a specific country (e.g., ${country}). Ideally the Discloser’s jurisdiction\n- Jurisdiction: Recipient submits to the lowest competent court of the Discloser’s jurisdiction.\n- Clause is non-exclusive, preserving Discloser’s flexibility to litigate elsewhere.\n- Non-Exclusivity: Discloser can engage with other parties freely – no exclusivity is implied.\n- Costs: Each party bears its own costs related to negotiation and execution of the agreement.\nPublicity\nRecipient cannot make any public or informal announcement (e.g. press, blog, social) without Discloser’s prior written consent.",
    "is_required": true,
    "clause_definition": "The \"General\" clause is a standard set of boilerplate legal terms that apply broadly to the agreement, regardless of its subject matter. These terms help govern how the contract is interpreted, modified, and enforced.\nWhere to Find:\nUsually found at the end of the agreement, following the substantive commercial or confidentiality terms.",
    "review_instruction": "1. Entire Agreement: A clear statement that the agreement is the entire understanding between the parties and overrides all prior discussions (written or oral).\nAcceptable: References to other written agreements (e.g., a Master Services Agreement) if clearly identified and consistent.\nRed Flags: Refers to verbal agreements or \"understandings\".\nIncludes vague carve-outs without naming documents.\nContradicts known agreements in place.\nGuidance: This clause is critical for limiting liability. It ensures only what's written counts. Flag if any non-written understandings are implied or if this clause conflicts with related contracts.\n2. No Future Agreements\nCheck for:\nA commitment to return or destroy confidential info if the parties don't proceed with a commercial relationship.\nAcceptable:\nAllows retention for legal/compliance purposes under ongoing confidentiality obligations.\nRed Flags:\nSilent on obligation to return/destroy info.\nAllows indefinite or broad retention rights.\nIgnores clause 7 (confidentiality obligations).\nGuidance:\nConfirm this aligns with the confidentiality clause. Retention must be narrow and conditional. Escalate if clause creates risk of unnecessary data exposure.\n3. Changes (Amendments)\nCheck for:\nAmendments must be in writing and signed by both parties.\nAcceptable:\nAllows digital signatures or email confirmation between authorised representatives (if legally valid).\nRed Flags:\nAllows oral modifications.\nPermits unilateral changes.\nLacks clear requirements for mutual consent.\nGuidance:\nThis clause ensures integrity of the agreement. Only written, mutually signed changes should be enforceable. Escalate any clause allowing verbal or implied amendments.\n4. Waiver (Giving Up Rights)\nCheck for:\nA statement that leniency or failure to enforce a right does not waive that right.\nAcceptable:\nRequires written waiver for it to be effective.\nRed Flags:\nSilence on waiver mechanics.\nPermits implied or automatic waiver.\nSuggests one party can waive by conduct.\nGuidance:\nPrevents parties from losing rights by inaction. Ensure waivers are deliberate and documented. Escalate ambiguity.\n5. Severability\nCheck for:\nThe clause allows invalid terms to be severed without impacting the rest of the agreement.\nAcceptable:\nAllows courts to modify or interpret the invalid clause to preserve the agreement’s intent.\nRed Flags:\nEntire agreement fails if one clause is invalid.\nRequires renegotiation of the whole agreement.\nSilent on impact of unenforceable terms.\nGuidance:\nProtects the remainder of the contract. Ensure the clause maintains enforceability of unaffected provisions.\n6. Governing Law\nCheck for:\nClear reference to the governing legal jurisdiction (e.g., \"laws of England and Wales\" or \"laws of Delaware\").\nAcceptable:\nA neutral or familiar jurisdiction to both parties (especially for international agreements).\nRed Flags:\nUnfamiliar or high-risk legal systems (especially for enforcement).\nConflict with arbitration clause or other legal terms.\nOmitted entirely.\nGuidance:\nFlag unfamiliar governing laws. Recommend aligning to the Discloser’s preferred legal system unless commercial reasons suggest otherwise.\n7. Jurisdiction\nCheck for:\nClear agreement on which courts can hear disputes — typically non-exclusive jurisdiction in the Discloser’s home forum.\nAcceptable:\nNon-exclusive jurisdiction in a logical location (e.g., where parties operate or where governing law applies).\nRed Flags:\nExclusive jurisdiction in recipient's territory.\nAmbiguous or missing jurisdiction terms.\nRestricts enforcement options.\nGuidance:\nEnsure the Discloser has flexibility to enforce in chosen courts. Avoid being locked into a foreign or hostile jurisdiction.\n8. Non-Exclusivity\nCheck for:\nLanguage confirming the agreement does not restrict either party from entering similar arrangements with others.\nAcceptable:\nSimply states that nothing in the agreement grants exclusivity.\nRed Flags:\nSuggests exclusivity or priority rights.\nRestrictions on Discloser engaging third parties.\nVague obligations about future engagement.\nGuidance:\nClause should protect both parties’ freedom to contract elsewhere. Flag any terms that resemble exclusivity unless commercially intended.\n9. Costs\nCheck for:\nEach party pays its own costs in connection with this agreement.\nAcceptable:\nShared costs for specific items (e.g., notarisation, filings) if documented elsewhere.\nRed Flags:\nOne party assumes the other’s legal or negotiation costs.\nUnexpected cost burdens.\nSilent on costs but others are implied elsewhere.\nGuidance:\nCost neutrality is standard. Flag anything that shifts costs unless specifically negotiated.\n10. Publicity\nCheck for:\nRecipient cannot make public or press statements without Discloser’s prior written consent.\nAcceptable:\nInternal disclosures (e.g., to legal, finance, or investors) with confidentiality protections.\nRed Flags:\nRecipient can disclose the relationship in marketing or PR.\nNo obligation to obtain Discloser’s consent.\nSilent on publicity entirely.\nGuidance:\nEnsure the clause protects the Discloser from premature or unwanted press or public exposure. Flag any marketing rights unless contractually agreed.",
    "example_ideal_clause": "Entire agreement. The agreement is the entire agreement between the parties on the subject.\nNo future agreements. If the parties elect not to pursue a new or expanded commercial relationship, all tangible confidential information will be returned to the discloser in line with clause 7 above, unless the parties subsequently enter into a written agreement that provides otherwise.\nChanges. No change to this agreement is effective unless in writing and signed with a handwritten signature by authorised signatories of both parties.\nWaiver (giving up of rights). Any favour Discloser may allow Recipient will not affect or substitute any of Discloser’s rights against Recipient.\nSeverability. If any term is void (invalid), unenforceable, or illegal, the term may be severed (removed) from and will not affect the rest of this agreement if it does not change its purpose.\nGoverning law. This agreement will be governed by and construed in accordance with the laws of ${country}.  \nJurisdiction. Recipient consents to the lowest jurisdiction of the ${courts_of_jurisdiciton} in respect of any action or proceedings Discloser may bring against Recipient in connection with this agreement, even if the action or proceedings would otherwise be beyond its jurisdiction, without prejudice to Disclosure’s right to institute any action in any other court having jurisdiction.\nNon-exclusivity. Disclosure may provide any goods or services to any other person or entity.\nCosts. Each party is responsible for its own costs of drafting and negotiating this agreement.\nPublicity. Recipient will not make or issue any formal or informal announcement or statement to the press in connection with this agreement, without Disclosures prior written consent.",
    "provision_definition": "The \"General\" clause is a standard set of boilerplate legal terms that apply broadly to the agreement, regardless of its subject matter. These terms help govern how the contract is interpreted, modified, and enforced.\nWhere to Find:\nUsually found at the end of the agreement, following the substantive commercial or confidentiality terms.",
    "example_fallback_clause": "Entire agreement. The agreement is the entire agreement between the parties on the subject.\nNo future agreements. If the parties elect not to pursue a new or expanded commercial relationship, all tangible confidential information will be returned to the discloser in line with clause 7 above, unless the parties subsequently enter into a written agreement that provides otherwise.\nChanges. No change to this agreement is effective unless in writing and signed with a handwritten signature by authorised signatories of both parties.\nWaiver (giving up of rights). Any favour Discloser may allow Recipient will not affect or substitute any of Discloser’s rights against Recipient.\nSeverability. If any term is void (invalid), unenforceable, or illegal, the term may be severed (removed) from and will not affect the rest of this agreement if it does not change its purpose.\nGoverning law. This agreement will be governed by and construed in accordance with the laws of ${country}.  \nJurisdiction. Recipient consents to the jurisdiction of the ${courts_of_jurisdiciton} in respect of any action or proceedings Discloser may bring against Recipient in connection with this agreement, even if the action or proceedings would otherwise be beyond its jurisdiction, without prejudice to Disclosure’s right to institute any action in any other court having jurisdiction.\nCosts. Each party is responsible for its own costs of drafting and negotiating this agreement."
  }
]